Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Just above this line is a short description of the 'wrap' option. Move the cursor one line up to place it in this line. Now hit <Enter> and you jump to the full help on the 'wrap' option.
es_es: Justo sobre esta línea hay una descripción corta de la opción 'wrap'. Ponga el cursor una línea arriba para colocarlos sobre esta línea. Ahora pulse <Intro> e irá hacia la descripción completa de la opción 'wrap'.

source: For options that take a number or string argument you can edit the value. Then press <Enter> to apply the new value. For example, move the cursor a few lines up to this line:
es_es: Para opciones que toman un número o una cadena de caracteres puede editar el valor. Pulse <Intro> para aplicar el nuevo valor. Por ejemplo, mueva el cursor unas cuantas líneas arriba hasta esta línea:

source: Position the cursor on the zero with "$". Change it into a five with "r5". Then press <Enter> to apply the new value. When you now move the cursor around you will notice that the text starts scrolling before you reach the border. This is what the 'scrolloff' option does, it specifies an offset from the window border where scrolling starts.
es_es: Posicione el cursor sobre el cero con «$». Modifiqueló a un cinco con «r5». Luego pulse <Intro> para aplicar el nuevo valor. Cuando mueva el cursor por un texto, notará que el texto se desplazará (scroll) antes de que llegue al borde. Esto es lo que la opción 'scrolloff' hace, especifica una compensación (offset) del punto donde comienza el desplazamiento (respecto al borde).

source: *05.7* Often used options
es_es: *05.7* Opciones más comunes

source: There are an awful lot of options. Most of them you will hardly ever use. Some of the more useful ones will be mentioned here. Don't forget you can find more help on these options with the ":help" command, with single quotes before and after the option name. For example: >
es_es: Hay una cantidad de opciones inmensa. Difícilmente llegará a usar gran parte de ellas. Algunas de las más comunes se citarán a continuación. No se olvide de que puede encontrar más ayuda con la orden «:help», con comillas simples alrededor del nombre de la opción. Por ejemplo: >

source: In case you have messed up an option value, you can set it back to the default by putting an ampersand (&) after the option name. Example: >
es_es: En caso de que haya descolocado el valor de una opción, puede devolverlo a la opción por defecto con un et (&) tras el nombre de la opción. Por ejemplo: >

source: Vim normally wraps long lines, so that you can see all of the text. Sometimes it's better to let the text continue right of the window. Then you need to scroll the text left-right to see all of a long line. Switch wrapping off with this command: >
es_es: Vim normalmente dobla líneas largas, de forma que pueda ver todo el texto. A veces es mejor dejar que el texto continúe a la derecha de la ventana. De este modo tiene que desplazarse de izquierda a derecha para ver toda una línea larga. Puede intercambiar el valor con la siguiente orden: >

source: Vim will automatically scroll the text when you move to text that is not displayed. To see a context of ten characters, do this: >
es_es: Vim automáticamente desplazará el texto cuando se desplace hacia el texto que no se muestra en pantalla. Para ver un contexto de diez caracteres: >

source: Most commands for moving around will stop moving at the start and end of a line. You can change that with the 'whichwrap' option. This sets it to the default value: >
es_es: La mayoría de las órdenes para desplazarse dejarán de funcionar al comienzo o al final de una línea. Puede cambiar esto con la opción 'whichwrap'. Esto la cambia al valor predeterminado: >

source: This allows the <BS> key, when used in the first position of a line, to move the cursor to the end of the previous line. And the <Space> key moves from the end of a line to the start of the next one.
es_es: Esto permite que la tecla <Retroceso>, cuando se emplea en la primera posición de una línea se mueva al final de la línea anterior. También la tecla <Espacio> le desplazará desde el final de una línea hasta el comienzo de la siguiente.

source: This is still only for Normal mode. To let <Left> and <Right> do this in Insert mode as well: >
es_es: Esto es exclusivamente en el modo Normal. Para permitir que <Izq> y <Der> haga esto en también modo Insertar, escriba: >

source: When there are tabs in a file, you cannot see where they are. To make them visible: >
es_es: Cuando hay pestañas en un archivo, no puede ver dónde están. Para hacerlas visibles: >

source: Now every tab is displayed as ^I. And a $ is displayed at the end of each line, so that you can spot trailing spaces that would otherwise go unnoticed. A disadvantage is that this looks ugly when there are many Tabs in a file. If you have a color terminal, or are using the GUI, Vim can show the spaces and tabs as highlighted characters. Use the 'listchars' option: >
es_es: Ahora todas las pestañas se mostrarán como ^I. Un «$» se mostrará al final de cada línea, permitiéndole ver espacios finales que de otra forma pasarían desapercibidos. Una desventaja de esto es que tiene una apariencia desagradable cuando hay muchas pestañas. Si tiene una terminal con colores o usa GVim, puede ver los espacios y las pestañas como marcas de color. Use la opción 'listchars': >

source: Now every tab will be displayed as ">---" (with more or less "-") and trailing white space as "-". Looks a lot better, doesn't it?
es_es: Ahora cada pestaña se mostrará como «>---» (con más o menos «-») y los espacios al final de la línea como «-». Más agradable, o no?

source: The "@" stands for all alphabetic letters. "48-57" stands for ASCII characters 48 to 57, which are the numbers 0 to 9. "192-255" are the printable latin characters. Sometimes you will want to include a dash in keywords, so that commands like "w" consider "upper-case" to be one word. You can do it like this: >
es_es: El «@» implica todas las letras del alfabeto. «48-57» significa los caracteres ASCII 48 a 57, que son los números 0 a 9. «192-255» son los caracteres latinos imprimibles. A veces querrá incluir un guión en las palabras clave, para que órdenes como «w» consideren «upper-case» como una sola palabra. Puede hacerlo así: >

source: If you look at the new value, you will see that Vim has added a comma for you. To remove a character use "-=". For example, to remove the underscore: >
es_es: Si miras el nuevo valor, comprobará que Vim ha añadido una coma por Ud. Para eliminar un carácter usa «-=». Por ejemplo, el guión bajo: >

source: When Vim starts there is one line at the bottom that is used for messages. When a message is long, it is either truncated, thus you can only see part of it, or the text scrolls and you have to press <Enter> to continue. You can set the 'cmdheight' option to the number of lines used for messages. Example: >
es_es: Cuando Vim arranca hay una línea en la parte de abajo que se usa para mensajes. Cuando un mensaje es largo, o se trunca (con lo que sólo puede ver una parte) o el texto se desplaza y tienes que pulsar <Intro> para continuar. Puedes asignar a la opción 'cmdheight' el número de líneas usado para mensajes. Por ejemplo: >

source: *usr_32.txt* For Vim version 7.3. Last change: 2010 Jul 20
es_es: *usr_32.esx* Para Vim versión 7.3. Último cambio: 20/6/2010

source: The undo tree
es_es: El árbol de deshacer

source: Vim provides multi-level undo. If you undo a few changes and then make a new change you create a branch in the undo tree. This text is about moving through the branches.
es_es: Vim ofrece varios niveles de deshacer. Si deshace unos cuantos cambios y después realiza uno nuevo, creará una rama en el árbol de deshacer. El texto a continuación trata acerca de desplazarse por las ramas.

source: |32.1| Undo up to a file write |32.2| Numbering changes |32.3| Jumping around the tree |32.4| Time travelling
es_es: |32.1| Volver a un punto de edición anterior |32.2| Numerar los cambios |32.3| Desplazarse en el árbol |32.4| Viajar en el tiempo

source: Next chapter: |usr_40.txt| Make new commands Previous chapter: |usr_31.txt| Exploiting the GUI Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_40.esx| Crear órdenes nuevas Capítulo anterior: |usr_31.esx| Aprovechar la interfaz gráfica Tabla de contenidos: |usr_toc.esx|

source: *32.1* Undo up to a file write
es_es: *32.1* Volver a un punto de edición anterior

source: Sometimes you make several changes, and then discover you want to go back to when you have last written the file. You can do that with this command: >
es_es: A veces realiza una serie de cambios, y se da cuenta que desea volver al punto en el que editó el archivo por última vez. Puede hacer esto con la siguiente orden: >

source: You can repeat this command to go further back in the past. Or use a count different from 1 to go back faster.
es_es: Puede repetir esta orden para retroceder aun más. O usar un número diferente de 1 para retroceder más rápido.

source: Note that these commands really work in time sequence. This matters if you made changes after undoing some changes. It's explained in the next section.
es_es: Tenga en cuenta que estas órdenes funcionan secuencialmente. Importa si realiza cambios después de deshacer otros. Se explica en la siguiente sección.

source: Also note that we are talking about text writes here. For writing the undo information in a file see |undo-persistence|.
es_es: Tenga también en cuenta que nos referimos a ediciones de texto. Para escribir la información de deshacer de en un archivo, consulte |undo-persistence|.

source: *32.2* Numbering changes
es_es: *32.2* Numerar los cambios

source: In section |02.5| we only discussed one line of undo/redo. But it is also possible to branch off. This happens when you undo a few changes and then make a new change. The new changes become a branch in the undo tree.
es_es: En la sección |02.5| sólo tratamos una línea temporal de deshacer o rehacer. Pero también es posible crear una nueva «rama». Ocurre cuando deshace algunos cambios y después realiza un nuevo cambio. Los cambios nuevos se convierten en una rama del árbol de deshacer.

source: Let's start with the text "one". The first change to make is to append " too". And then move to the first 'o' and change it into 'w'. We then have two changes, numbered 1 and 2, and three states of the text:
es_es: Empecemos con el texto «one». El primer cambio es añadir «too». Después, ir a la primera «o» y cambiarla a «w». Tenemos ahora dos cambios, 1 y 2, y tres estados del texto:

source: You can now use the |u| command to undo. If you do this twice you get to "one". Use |CTRL-R| to redo, and you will go to "one too". One more |CTRL-R| takes you to "me too". Thus undo and redo go up and down in the tree, using the branch that was last used.
es_es: Ahora puede usar la orden |u| para deshacer. Si lo hace dos veces, obtendrá «one». Use |CTRL-R| para rehacer, y obtendrá «one too». Pulsar |CTRL-R| una vez más le lleva a «me too». Esto es, deshacer y rehacer suben y bajan un árbol usando la rama usada por última vez.

source: What matters here is the order in which the changes are made. Undo and redo are not considered changes in this context. After each change you have a new state of the text.
es_es: Lo que importa es el orden de las cambios. Deshacer y rehacer no se consideran cambios en este contexto. Tras cada cambio tiene un nuevo estado del texto.

source: Note that only the changes are numbered, the text shown in the tree above has no identifier. They are mostly referred to by the number of the change above it. But sometimes by the number of one of the changes below it, especially when moving up in the tree, so that you know which change was just undone.
es_es: Tenga en cuenta que sólo se enumeran los cambios, y el texto que aparece en el árbol anterior no tiene identificador. Se hace referencia a ellos según el número del cambio por encima suyo. Pero, a veces, según el número por debajo de él, particularmente al subir el árbol, para así saber qué cambio se ha deshecho recientemente.

source: *32.3* Jumping around the tree
es_es: *32.3* Desplazarse en el árbol

source: So how do you get to "one two" now? You can use this command: >
es_es: ¿Cómo podemos obtener «one two» ahora? Puede usar esta orden: >

source: The text is now "one two", you are below change 2. You can use the |:undo| command to jump to below any change in the tree.
es_es: Ahora, el texto es «one two», y está bajo el cambio 2. Puede usar la orden |:undo| para saltar a cualquier cambio dentro del árbol.

source: Now you change your mind and want to go back to "me too". Use the |g-| command. This moves back in time. Thus it doesn't walk the tree upwards or downwards, but goes to the change made before.
es_es: Ahora cambia de idea, y desea volver a «me too». Use la orden |g-|. Esto vuelve a un momento anterior. No se desplaza por el árbol en una dirección u otra, sino que vuelve al último cambio realizado.

source: You can repeat |g-| and you will see the text change: me too ~ one two ~ one too ~ one ~
es_es: Puede repetir |g-| y ver como cambia el texto: me too ~ one two ~ one too ~ one ~

source: Use |g+| to move forward in time: one ~ one too ~ one two ~ me too ~ not two ~
es_es: Use |g+| para ir hacia delante en el tiempo: one ~ one too ~ one two ~ me too ~ not two ~

source: Using |:undo| is useful if you know what change you want to jump to. |g-| and |g+| are useful if you don't know exactly what the change number is.
es_es: Usar |:undo| es útil si sabe a qué cambio quiere pasar. |g-| y |g+| son útiles si no sabe exactamente el número del cambio.

source: *32.4* Time travelling
es_es: *32.4* Viajar en el tiempo

source: When you have been working on text for a while the tree grows to become big. Then you may want to go to the text of some minutes ago.
es_es: Cuando ha estado trabajando en el texto durante un rato el árbol crece hasta ser bastante grande. Así, puede que desee volver a como era el texto hace unos minutos.

source: :undolist < number changes time ~ 3 2 16 seconds ago 4 3 5 seconds ago
es_es: :undolist < número cambios hora ~ 3 2 hace 16 segundos 4 3 hace 5 segundos

source: Here you can see the number of the leaves in each branch and when the change was made. Assuming we are below change 4, at "not two", you can go back ten seconds with this command: >
es_es: Aquí puede ver el número de hojas en cada rama el momento en que se realizó el cambio. Suponiendo que estamos bajo el nivel 4, en «not two», puede retroceder 10 segundos con la siguiente orden:

source: Depending on how much time you took for the changes you end up at a certain position in the tree. The |:earlier| command argument can be "m" for minutes, "h" for hours and "d" for days. To go all the way back use a big number: >
es_es: Dependiendo del tiempo que le tomó realizar los cambios, acabará en una posición determinada del árbol. El argumento de la orden |:earlier| puede ser «m», de minutos, «h» de horas y «d» de días. Para volver al principio use un número grande: >

source: If you want even more details, or want to manipulate the information, you can use the |undotree()| function. To see what it returns: >
es_es: Si desea más detalles, o manipular la información, puede usar la función |undotree()|. Para ver qué devuelve: >

source: *usr_25.txt* For Vim version 7.3. Last change: 2007 May 11
es_es: *usr_25.esx* Para Vim versión 7.3. Último cambio: 11/6/2007

source: Editing formatted text
es_es: Editar texto con formato

source: Text hardly ever comes in one sentence per line. This chapter is about breaking sentences to make them fit on a page and other formatting. Vim also has useful features for editing single-line paragraphs and tables.
es_es: El texto rara vez aparece como una oración por línea. Este capítulo trata acerca de formatear oraciones para su correcta apariencia en un papel, así como otros formatos. Vim también ofrece útiles características para editar párrafos de una sola línea y tablas-

source: |25.1| Breaking lines |25.2| Aligning text |25.3| Indents and tabs |25.4| Dealing with long lines |25.5| Editing tables
es_es: |25.1| Dividir líneas |25.2| Alinear texto |25.3| Sangrado y tabulación |25.4| Tratar líneas largas |25.5| Editar tablas

source: Next chapter: |usr_26.txt| Repeating Previous chapter: |usr_24.txt| Inserting quickly Table of contents: |usr_toc.txt|
es_es: Siguiente capítulo: |usr_26.txt| Repetición Capítulo anterior: |usr_24.esx| Insertar con rapidez Tabla de contenidos: |usr_toc.esx|

source: *25.1* Breaking lines
es_es: *25.1* Dividir líneas

source: 1 2 3 12345678901234567890123456789012345 I taught programming for a whi ~
es_es: 1 2 3 12345678901234567890123456789012345 Enseñé programación durante un ~

source: If you type "l" next, this makes the line longer than the 30-character limit. When Vim sees this, it inserts a line break and you get the following:
es_es: Si teclea ahora «os», la línea sobrepasaría el límite de 30 caracteres. En cuanto Vim detecta esto, inserta un salto línea, obteniendo lo siguiente:

source: 1 2 3 12345678901234567890123456789012345 I taught programming for a ~ whil ~
es_es: 1 2 3 12345678901234567890123456789012345 Enseñé programación durante ~ unos ~

source: Note: The 'wrap' option makes Vim display lines with a line break, but this doesn't insert a line break in the file.
es_es: Nota: La opción 'wrap' hace que Vim muestre las líneas con un salto de línea, pero no inserta realmente un salto de línea.

source: The Vim editor is not a word processor. In a word processor, if you delete something at the beginning of the paragraph, the line breaks are reworked. In Vim they are not; so if you delete the word "programming" from the first line, all you get is a short line:
es_es: El editor Vim no es un editor de documentos. En un editor de documentos, si elimina algo al inicio del párrafo, se reorganizan los saltos de línea. No es así en Vim; así que se borra la palabra «programación» en la primera línea, obtendría los siguiente:

source: This does not look good. To get the paragraph into shape you use the "gq" operator. Let's first use this with a Visual selection. Starting from the first line, type: >
es_es: Esto no es elegante. Para dar formato a un párrafo puede usar el operador «gq». Usemos esto primero con una selección en modo Visual. Empezando por la primera línea, escriba: >

source: "v" to start Visual mode, "4j' to move to the end of the paragraph and then the "gq" operator. The result is:
es_es: «v» inicial el modo Visual, «4j» para desplazarse al final del párrafo, y después el operador «gq». El resultado es:

source: "ap" stands for "a-paragraph". This formats the text of one paragraph (separated by empty lines). Also the part before the cursor. If you have your paragraphs separated by empty lines, you can format the whole file by typing this: >
es_es: «ap» significa un párrafo («a-paragraph»). Esto da formato al texto de un párrafo (separado por líneas vacías). También el área anterior al cursor. Si los párrafos están separados por líneas vacías, puede dar formato a todo el archivo con lo siguiente: >

source: "gg" to move to the first line, "gqG" to format until the last line. Warning: If your paragraphs are not properly separated, they will be joined together. A common mistake is to have a line with a space or tab. That's a blank line, but not an empty line.
es_es: «gg» para ir a la primera línea, «gqG» para dar formato hasta la última línea. Aviso: si sus párrafos no están apropiadamente separados, no se unirán. Un error común es tener una línea con un espacio o tabulación. Esa es una línea en blanco, pero no una línea vacía.

source: Vim is able to format more than just plain text. See |fo-table| for how to change this. See the 'joinspaces' option to change the number of spaces used after a full stop. It is possible to use an external program for formatting. This is useful if your text can't be properly formatted with Vim's builtin command. See the 'formatprg' option.
es_es: Vim es capaz de dar formato a más que texto. Consulte |fo-table| para ver cómo cambiar esto. Consulte la opción 'joinspaces' para modificar el número de espacios antes de un punto final. Es posible dar formato con un programa externo. Esto es útil si el texto no puede recibir un formato adecuado con la orden integrada en Vim. Consulte la opción 'formatprg'.

source: *25.2* Aligning text
es_es: *25.2* Alinear texto

source: {range} is the usual command-line range. [width] is an optional line width to use for centering. If [width] is not specified, it defaults to the value of 'textwidth'. (If 'textwidth' is 0, the default is 80.) For example: >
es_es: {range} (rango) is el valor de rango normal en la línea de órdenes. [width] (ancho) es el valor opcional del ancho usado al centrar. De no especificar [width], su valor por omisión será el de 'textwidth'. (Si 'textwith' es cero, el valor será 80.) Por ejemplo: >

source: Vim has no built-in way of justifying text. However, there is a neat macro package that does the job. To use this package, execute the following command: >
es_es: Vim no posee una herramienta integrada para justificar texto. Por otro lado, ofrece un excelente macro que realiza esta labor. Ejecute la siguiente orden para usar este conjunto: >

source: This Vim script file defines a new visual command "_j". To justify a block of text, highlight the text in Visual mode and then execute "_j". Look in the file for more explanations. To go there, do "gf" on this name: $VIMRUNTIME/macros/justify.vim.
es_es: Este archivo script de Vim define una nueva orden visual, «_j». Para justificar un bloque de texto, resalte el texto en modo Visual y ejecute «_j». Consulte el archivo para una explicación más completa. Para ir a ese punto, pulse «gf» en este nombre: $VIMRUNTIME/macros/justify.vim.

source: An alternative is to filter the text through an external program. Example: >
es_es: Una alternativa es filtrar el texto a través de un programa externo. Ejemplo: >

source: *25.3* Indents and tabs
es_es: *25.3* Sangrado y tabulación

source: Indents can be used to make text stand out from the rest. The example texts in this manual, for example, are indented by eight spaces or a tab. You would normally enter this by typing a tab at the start of each line. Take this text: the first line ~ the second line ~
es_es: Puede usar el sangrado para destacar texto con respecto al resto. Los textos de ejemplo en este manual, por ejemplo, están sangrados con ocho espacios, o una tabulación. Generalmente, introduce el sangrado con una tabulación al inicio de cada línea. Suponga este texto: la primera línea ~ la segunda línea ~

source: This is entered by typing a tab, some text, <Enter>, tab and more text. The 'autoindent' option inserts indents automatically: >
es_es: Puede introducir esto pulsando el botón de tabulado, algo de texto, <Intro>, tabulado, y más texto. La opción 'autoindent' inserta sangrado automáticamente: >

source: When a new line is started it gets the same indent as the previous line. In the above example, the tab after the <Enter> is not needed anymore.
es_es: Al iniciar una nueva línea, este recibirá el mismo sangrado que la línea anterior. En el ejemplo anterior, el tabulado tras <Intro> ya no es necesario.
